Enums/ВариантыОтраженияКорректировокПоступлений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ВариантыОтраженияКорректировокПоступлений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтразитьНаПрочихДоходах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписатьНаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УвеличитьЗакупкуУвеличитьСкладскиеОстатки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УвеличитьЗакупкуУчестьПриИнвентаризации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УвеличитьСтоимостьТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшитьЗакупкуУменьшитьСкладскиеОстатки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшитьЗакупкуУчестьПриИнвентаризации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшитьСтоимостьТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УвеличитьЗакупкуУвеличитьТоварыУПартнеров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УменьшитьЗакупкуУменьшитьТоварыУПартнеров</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОтраженияКорректировокПоступлений/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ТекстПояснения = "";
	ВысотаПояснения = 1;
	
	Если Параметры.Отбор.Свойство("Ссылка")
	 И ТипЗнч(Параметры.Отбор.Ссылка) = Тип("СписокЗначений") Тогда
	 	
	 	ДоступныеВарианты = Параметры.Отбор.Ссылка;
		Если ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокПоступлений.УвеличитьЗакупкуУчестьПриИнвентаризации) <> Неопределено Тогда
			ВысотаПояснения = 4;
			ТекстПояснения = НСтр("ru='Количество товара по документу больше. Используется ордерная схема при отражении излишков и недостач.'") + Символы.ПС + Символы.ПС;
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокПоступлений.УвеличитьЗакупкуУвеличитьСкладскиеОстатки) <> Неопределено Тогда
			ВысотаПояснения = 4;
			ТекстПояснения = НСтр("ru='Количество товара по документу больше. Не используется ордерная схема при отражении излишков и недостач.'") + Символы.ПС + Символы.ПС;
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокПоступлений.УменьшитьЗакупкуУчестьПриИнвентаризации) <> Неопределено Тогда
			ВысотаПояснения = 4;
			ТекстПояснения = НСтр("ru='Количество товара по документу меньше. Используется ордерная схема при отражении излишков и недостач.'") + Символы.ПС + Символы.ПС;
		ИначеЕсли ДоступныеВарианты.НайтиПоЗначению(Перечисления.ВариантыОтраженияКорректировокПоступлений.УменьшитьЗакупкуУменьшитьСкладскиеОстатки) <> Неопределено Тогда
			ВысотаПояснения = 4;
			ТекстПояснения = НСтр("ru='Количество товара по документу меньше. Не используется ордерная схема при отражении излишков и недостач.'") + Символы.ПС + Символы.ПС;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ТекстПояснения.Высота = ВысотаПояснения;
	ТекстПояснения = ТекстПояснения + НСтр("ru='Выберите вариант отражения расхождений:'");
	
КонецПроцедуры

#КонецОбласти
